Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedLoad Class
 The AnalysisDecomposedLoad class contains information related to decomposed loads.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisDecomposedLoad
 More...
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public abstract class AnalysisDecomposedLoad : AnalysisObject
Public MustInherit Class AnalysisDecomposedLoad
	Inherits AnalysisObject
The AnalysisDecomposedLoad type exposes the following members.
Constructors
Name | Description
AnalysisDecomposedLoad
 Initializes a new instance of the AnalysisDecomposedLoad class.
Top
Properties
Name | Description
AnalysisLoadType
 Gets or sets the type of the analysis decomposed load.
AnalysisModelName
 Gets or sets the analysis model name.
 (Inherited from AnalysisObject.)
AnalysisObjectType
 Gets or sets the type of the analysis object.
 (Inherited from AnalysisObject.)
FatherObject2ID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObject2Type
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
FatherObjectID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObjectType
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
ID
 Gets or sets the identifier of the analysis object.
 (Inherited from AnalysisObject.)
ModelLoadGroupID
 Gets or sets the identifier of the load group.
ModelLoadID
 Gets or sets the identifier of the model load.
ObjectAttachedToID
 Gets or sets the identifier of the object the load is attached to.
ObjectAttachedToType
 Gets or sets the type of the object the load is attached to.
Top
Methods
Name | Description
Select
 Selects an analysis object from the database.
 (Inherited from AnalysisObject.)
Top
See Also
Reference
Tekla.Structures.Analysis Namespace
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisDecomposedLoad
 Tekla.Structures.Analysis.AnalysisDecomposedAreaLoad
 Tekla.Structures.Analysis.AnalysisDecomposedBarLoad
 Tekla.Structures.Analysis.AnalysisDecomposedMemberLoad
 Tekla.Structures.Analysis.AnalysisDecomposedNodeLoad
 Tekla.Structures.Analysis.AnalysisDecomposedSelfweightLoad
 Tekla.Structures.Analysis.AnalysisDecomposedTemperatureLoad